apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_aux_sysif.h
#define AUX_SYSIF_OPMODEREQ_REQ_SHIFT                   (0)       /* Bits 0-1: AUX operational mode request */
#define AUX_SYSIF_OPMODEREQ_REQ_MASK                    (3 << AUX_SYSIF_OPMODEREQ_REQ_SHIFT)
#  define AUX_SYSIF_OPMODEREQ_REQ(n)                    ((uint32_t)(n) << AUX_SYSIF_OPMODEREQ_REQ_SHIFT)
#  define AUX_SYSIF_OPMODEREQ_REQ_A                     (0 << AUX_SYSIF_OPMODEREQ_REQ_SHIFT) /* Active operational mode */
#  define AUX_SYSIF_OPMODEREQ_REQ_LP                    (1 << AUX_SYSIF_OPMODEREQ_REQ_SHIFT) /* Low power operational mode */
#  define AUX_SYSIF_OPMODEREQ_REQ_PDA                   (2 << AUX_SYSIF_OPMODEREQ_REQ_SHIFT) /* Power down operational mode
                                                                                              * with wakeup to active mode */
#  define AUX_SYSIF_OPMODEREQ_REQ_PDLP                  (3 << AUX_SYSIF_OPMODEREQ_REQ_SHIFT) /* Powerdown operational mode
                                                                                              *  with wakeup to lowpower mode */

/* AUX_SYSIF_OPMODEACK */

#define AUX_SYSIF_OPMODEACK_ACK_SHIFT                   (0)       /* Bits 0-1: AUX operational mode acknowledgment */
#define AUX_SYSIF_OPMODEACK_ACK_MASK                    (3 << AUX_SYSIF_OPMODEACK_ACK_SHIFT)
#  define AUX_SYSIF_OPMODEACK_ACK_A                     (0 << AUX_SYSIF_OPMODEACK_ACK_SHIFT) /* Active operational mode */
#  define AUX_SYSIF_OPMODEACK_ACK_LP                    (1 << AUX_SYSIF_OPMODEACK_ACK_SHIFT) /* Low power operational mode */
#  define AUX_SYSIF_OPMODEACK_ACK_PDA                   (2 << AUX_SYSIF_OPMODEACK_ACK_SHIFT) /* Power down operational mode
                                                                                              * with wakeup to active mode */
#  define AUX_SYSIF_OPMODEACK_ACK_PDLP                  (3 << AUX_SYSIF_OPMODEACK_ACK_SHIFT) /* Powerdown operational mode
                                                                                              *  with wakeup to lowpower mode */

/* AUX_SYSIF_PROGWU0CFG */

#define AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT                      (0)       /* Bits 0-5: Wakeup source from the asynchronous AUX event bus */
#define AUX_SYSIF_PROGWU0CFG_WU_SRC_MASK                       (0x3f << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC(n)                       ((uint32_t)(n) << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO0                   (0x00 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO1                   (0x01 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO2                   (0x02 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO3                   (0x03 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO4                   (0x04 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO5                   (0x05 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO6                   (0x06 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO7                   (0x07 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO8                   (0x08 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO9                   (0x09 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO10                  (0x0a << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO11                  (0x0b << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO12                  (0x0c << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO13                  (0x0d << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO14                  (0x0e << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO15                  (0x0f << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO16                  (0x10 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO17                  (0x11 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO18                  (0x12 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO19                  (0x13 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO20                  (0x14 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO21                  (0x15 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO22                  (0x16 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO23                  (0x17 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO24                  (0x18 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO25                  (0x19 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO26                  (0x1a << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO27                  (0x1b << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO28                  (0x1c << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO29                  (0x1d << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO30                  (0x1e << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUXIO31                  (0x1f << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_MANUAL_EV                (0x20 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AON_RTC_CH2              (0x21 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AON_RTC_CH2_DLY          (0x22 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AON_RTC_4KHZ             (0x23 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AON_BATMON_BAT_UPD       (0x24 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AON_BATMON_TEMP_UPD      (0x25 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_SCLK_LF                  (0x26 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_PWR_DWN                  (0x27 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_MCU_ACTIVE               (0x28 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_VDDR_RECHARGE            (0x29 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_ACLK_REF                 (0x2a << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_MCU_EV                   (0x2b << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_MCU_OBSMUX0              (0x2c << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_MCU_OBSMUX1              (0x2d << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_COMPA                (0x2e << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_COMPB                (0x2f << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_TIMER2_EV0           (0x30 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_TIMER2_EV1           (0x31 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_TIMER2_EV2           (0x32 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_TIMER2_EV3           (0x33 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_TIMER2_PULSE         (0x34 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_TIMER1_EV            (0x35 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_TIMER0_EV            (0x36 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_TDC_DONE             (0x37 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_ISRC_RESET_N         (0x38 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_ADC_DONE             (0x39 << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_ADC_IRQ              (0x3a << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_ADC_FIFO_ALMOST_FULL (0x3b << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_ADC_FIFO_NOT_EMPTY   (0x3c << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_AUX_SMPH_AUTOTAKE_DONE   (0x3d << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU0CFG_WU_SRC_NO_EVENT                 (0x3f << AUX_SYSIF_PROGWU0CFG_WU_SRC_SHIFT)
#define AUX_SYSIF_PROGWU0CFG_EN                                (1 << 6)  /* Bit 6:  Programmable wakeup flag enable */
#define AUX_SYSIF_PROGWU0CFG_POL                               (1 << 7)  /* Bit 7:  Polarity of WU_SRC */
#  define AUX_SYSIF_PROGWU0CFG_POL_LOW                         AUX_SYSIF_PROGWU0CFG_POL
#  define AUX_SYSIF_PROGWU0CFG_POL_HIGH                        (0)

/* AUX_SYSIF_PROGWU1CFG */

#define AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT                      (0)       /* Bits 0-5: Wakeup source from the asynchronous AUX event bus */
#define AUX_SYSIF_PROGWU1CFG_WU_SRC_MASK                       (0x3f << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO0                   (0x00 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO1                   (0x01 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO2                   (0x02 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO3                   (0x03 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO4                   (0x04 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO5                   (0x05 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO6                   (0x06 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO7                   (0x07 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO8                   (0x08 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO9                   (0x09 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO10                  (0x0a << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO11                  (0x0b << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO12                  (0x0c << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO13                  (0x0d << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO14                  (0x0e << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO15                  (0x0f << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO16                  (0x10 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO17                  (0x11 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO18                  (0x12 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO19                  (0x13 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO20                  (0x14 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO21                  (0x15 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO22                  (0x16 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO23                  (0x17 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO24                  (0x18 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO25                  (0x19 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO26                  (0x1a << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO27                  (0x1b << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO28                  (0x1c << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO29                  (0x1d << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO30                  (0x1e << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUXIO31                  (0x1f << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_MANUAL_EV                (0x20 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AON_RTC_CH2              (0x21 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AON_RTC_CH2_DLY          (0x22 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AON_RTC_4KHZ             (0x23 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AON_BATMON_BAT_UPD       (0x24 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AON_BATMON_TEMP_UPD      (0x25 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_SCLK_LF                  (0x26 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_PWR_DWN                  (0x27 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_MCU_ACTIVE               (0x28 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_VDDR_RECHARGE            (0x29 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_ACLK_REF                 (0x2a << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_MCU_EV                   (0x2b << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_MCU_OBSMUX0              (0x2c << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_MCU_OBSMUX1              (0x2d << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUX_COMPA                (0x2e << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUX_COMPB                (0x2f << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUX_TIMER2_EV0           (0x30 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUX_TIMER2_EV1           (0x31 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUX_TIMER2_EV2           (0x32 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUX_TIMER2_EV3           (0x33 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUX_TIMER2_PULSE         (0x34 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUX_TIMER1_EV            (0x35 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUX_TIMER0_EV            (0x36 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUX_TDC_DONE             (0x37 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUX_ISRC_RESET_N         (0x38 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUX_ADC_DONE             (0x39 << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUX_ADC_IRQ              (0x3a << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUX_ADC_FIFO_ALMOST_FULL (0x3b << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUX_ADC_FIFO_NOT_EMPTY   (0x3c << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_AUX_SMPH_AUTOTAKE_DONE   (0x3d << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#  define AUX_SYSIF_PROGWU1CFG_WU_SRC_NO_EVENT                 (0x3f << AUX_SYSIF_PROGWU1CFG_WU_SRC_SHIFT)
#define AUX_SYSIF_PROGWU1CFG_EN                                (1 << 6)  /* Bit 6:  Programmable wakeup flag enable */
#define AUX_SYSIF_PROGWU1CFG_POL                               (1 << 7)  /* Bit 7:  Polarity of WU_SRC */
#  define AUX_SYSIF_PROGWU1CFG_POL_LOW                         AUX_SYSIF_PROGWU1CFG_POL
#  define AUX_SYSIF_PROGWU1CFG_POL_HIGH                        (0)

/* AUX_SYSIF_PROGWU2CFG */

