apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_aux_sysif.h
#define AUX_SYSIF_WUFLAGS_PROG_WU0                      (1 << 0)  /* Bit 0:  Programmable wakeup 0. */
#define AUX_SYSIF_WUFLAGS_PROG_WU1                      (1 << 1)  /* Bit 1:  Programmable wakeup 1 */
#define AUX_SYSIF_WUFLAGS_PROG_WU2                      (1 << 2)  /* Bit 2:  Programmable wakeup 2 */
#define AUX_SYSIF_WUFLAGS_PROG_WU3                      (1 << 3)  /* Bit 3:  Programmable wakeup 3 */
#define AUX_SYSIF_WUFLAGS_SW_WU0                        (1 << 4)  /* Bit 4:  Software wakeup 0 flag */
#define AUX_SYSIF_WUFLAGS_SW_WU1                        (1 << 5)  /* Bit 5:  Software wakeup 1 flag */
#define AUX_SYSIF_WUFLAGS_SW_WU2                        (1 << 6)  /* Bit 6:  Software wakeup 2 flag */
#define AUX_SYSIF_WUFLAGS_SW_WU3                        (1 << 7)  /* Bit 7:  Software wakeup 3 flag */

/* AUX_SYSIF_WUFLAGSCLR */

#define AUX_SYSIF_WUFLAGSCLR_PROG_WU0                   (1 << 0)  /* Bit 0:  Programmable wakeup flag 0 */
#define AUX_SYSIF_WUFLAGSCLR_PROG_WU1                   (1 << 1)  /* Bit 1:  Programmable wakeup flag 1 */
#define AUX_SYSIF_WUFLAGSCLR_PROG_WU2                   (1 << 2)  /* Bit 2:  Programmable wakeup flag 2 */
#define AUX_SYSIF_WUFLAGSCLR_PROG_WU3                   (1 << 3)  /* Bit 3:  Programmable wakeup flag 3 */
#define AUX_SYSIF_WUFLAGSCLR_SW_WU0                     (1 << 4)  /* Bit 4:  Clear software wakeup flag 0 */
#define AUX_SYSIF_WUFLAGSCLR_SW_WU1                     (1 << 5)  /* Bit 5:  Clear software wakeup flag 1 */
#define AUX_SYSIF_WUFLAGSCLR_SW_WU2                     (1 << 6)  /* Bit 6:  Clear software wakeup flag 2 */
#define AUX_SYSIF_WUFLAGSCLR_SW_WU3                     (1 << 7)  /* Bit 7:   Clear software wakeup flag 3 */

/* AUX_SYSIF_WUGATE */

#define AUX_SYSIF_WUGATE_EN                             (1 << 0)  /* Bit 0:  Wakeup output enable */

/* AUX_SYSIF_VECCFG0 */

#define AUX_SYSIF_VECCFG0_VEC_EV_SHIFT                  (0)       /* Bits 0-3: Select trigger event for vector 0 */
#define AUX_SYSIF_VECCFG0_VEC_EV_MASK                   (15 << AUX_SYSIF_VECCFG0_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG0_VEC_EV(n)                   ((uint32_t)(n) << AUX_SYSIF_VECCFG0_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG0_VEC_EV_NONE                 (0 << AUX_SYSIF_VECCFG0_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG0_VEC_EV_PROG_WU0             (1 << AUX_SYSIF_VECCFG0_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG0_VEC_EV_PROG_WU1             (2 << AUX_SYSIF_VECCFG0_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG0_VEC_EV_PROG_WU2             (3 << AUX_SYSIF_VECCFG0_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG0_VEC_EV_PROG_WU3             (4 << AUX_SYSIF_VECCFG0_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG0_VEC_EV_SW_WU0               (5 << AUX_SYSIF_VECCFG0_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG0_VEC_EV_SW_WU1               (6 << AUX_SYSIF_VECCFG0_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG0_VEC_EV_SW_WU2               (7 << AUX_SYSIF_VECCFG0_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG0_VEC_EV_SW_WU3               (8 << AUX_SYSIF_VECCFG0_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG0_VEC_EV_AON_RTC_CH2_DLY      (9 << AUX_SYSIF_VECCFG0_VEC_EV_SHIFT)

/* AUX_SYSIF_VECCFG1 */

#define AUX_SYSIF_VECCFG1_VEC_EV_SHIFT                  (0)       /* Bits 0-3: Select trigger event for vector 1 */
#define AUX_SYSIF_VECCFG1_VEC_EV_MASK                   (15 << AUX_SYSIF_VECCFG1_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG1_VEC_EV(n)                   ((uint32_t)(n) << AUX_SYSIF_VECCFG1_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG1_VEC_EV_NONE                 (0 << AUX_SYSIF_VECCFG1_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG1_VEC_EV_PROG_WU0             (1 << AUX_SYSIF_VECCFG1_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG1_VEC_EV_PROG_WU1             (2 << AUX_SYSIF_VECCFG1_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG1_VEC_EV_PROG_WU2             (3 << AUX_SYSIF_VECCFG1_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG1_VEC_EV_PROG_WU3             (4 << AUX_SYSIF_VECCFG1_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG1_VEC_EV_SW_WU0               (5 << AUX_SYSIF_VECCFG1_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG1_VEC_EV_SW_WU1               (6 << AUX_SYSIF_VECCFG1_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG1_VEC_EV_SW_WU2               (7 << AUX_SYSIF_VECCFG1_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG1_VEC_EV_SW_WU3               (8 << AUX_SYSIF_VECCFG1_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG1_VEC_EV_AON_RTC_CH2_DLY      (9 << AUX_SYSIF_VECCFG1_VEC_EV_SHIFT)

/* AUX_SYSIF_VECCFG2 */

#define AUX_SYSIF_VECCFG2_VEC_EV_SHIFT                  (0)       /* Bits 0-3: Select trigger event for vector 2 */
#define AUX_SYSIF_VECCFG2_VEC_EV_MASK                   (15 << AUX_SYSIF_VECCFG2_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG2_VEC_EV(n)                   ((uint32_t)(n) << AUX_SYSIF_VECCFG2_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG2_VEC_EV_NONE                 (0 << AUX_SYSIF_VECCFG2_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG2_VEC_EV_PROG_WU0             (1 << AUX_SYSIF_VECCFG2_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG2_VEC_EV_PROG_WU1             (2 << AUX_SYSIF_VECCFG2_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG2_VEC_EV_PROG_WU2             (3 << AUX_SYSIF_VECCFG2_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG2_VEC_EV_PROG_WU3             (4 << AUX_SYSIF_VECCFG2_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG2_VEC_EV_SW_WU0               (5 << AUX_SYSIF_VECCFG2_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG2_VEC_EV_SW_WU1               (6 << AUX_SYSIF_VECCFG2_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG2_VEC_EV_SW_WU2               (7 << AUX_SYSIF_VECCFG2_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG2_VEC_EV_SW_WU3               (8 << AUX_SYSIF_VECCFG2_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG2_VEC_EV_AON_RTC_CH2_DLY      (9 << AUX_SYSIF_VECCFG2_VEC_EV_SHIFT)

/* AUX_SYSIF_VECCFG3 */

#define AUX_SYSIF_VECCFG3_VEC_EV_SHIFT                  (0)       /* Bits 0-3: Select trigger event for vector 3 */
#define AUX_SYSIF_VECCFG3_VEC_EV_MASK                   (15 << AUX_SYSIF_VECCFG3_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG3_VEC_EV(n)                   ((uint32_t)(n) << AUX_SYSIF_VECCFG3_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG3_VEC_EV_NONE                 (0 << AUX_SYSIF_VECCFG3_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG3_VEC_EV_PROG_WU0             (1 << AUX_SYSIF_VECCFG3_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG3_VEC_EV_PROG_WU1             (2 << AUX_SYSIF_VECCFG3_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG3_VEC_EV_PROG_WU2             (3 << AUX_SYSIF_VECCFG3_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG3_VEC_EV_PROG_WU3             (4 << AUX_SYSIF_VECCFG3_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG3_VEC_EV_SW_WU0               (5 << AUX_SYSIF_VECCFG3_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG3_VEC_EV_SW_WU1               (6 << AUX_SYSIF_VECCFG3_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG3_VEC_EV_SW_WU2               (7 << AUX_SYSIF_VECCFG3_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG3_VEC_EV_SW_WU3               (8 << AUX_SYSIF_VECCFG3_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG3_VEC_EV_AON_RTC_CH2_DLY      (9 << AUX_SYSIF_VECCFG3_VEC_EV_SHIFT)

/* AUX_SYSIF_VECCFG4 */

#define AUX_SYSIF_VECCFG4_VEC_EV_SHIFT                  (0)       /* Bits 0-3: Select trigger event for vector 4 */
#define AUX_SYSIF_VECCFG4_VEC_EV_MASK                   (15 << AUX_SYSIF_VECCFG4_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG4_VEC_EV(n)                   ((uint32_t)(n) << AUX_SYSIF_VECCFG4_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG4_VEC_EV_NONE                 (0 << AUX_SYSIF_VECCFG4_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG4_VEC_EV_PROG_WU0             (1 << AUX_SYSIF_VECCFG4_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG4_VEC_EV_PROG_WU1             (2 << AUX_SYSIF_VECCFG4_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG4_VEC_EV_PROG_WU2             (3 << AUX_SYSIF_VECCFG4_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG4_VEC_EV_PROG_WU3             (4 << AUX_SYSIF_VECCFG4_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG4_VEC_EV_SW_WU0               (5 << AUX_SYSIF_VECCFG4_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG4_VEC_EV_SW_WU1               (6 << AUX_SYSIF_VECCFG4_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG4_VEC_EV_SW_WU2               (7 << AUX_SYSIF_VECCFG4_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG4_VEC_EV_SW_WU3               (8 << AUX_SYSIF_VECCFG4_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG4_VEC_EV_AON_RTC_CH2_DLY      (9 << AUX_SYSIF_VECCFG4_VEC_EV_SHIFT)

