apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_aux_sysif.h
/* AUX_SYSIF_VECCFG5 */

#define AUX_SYSIF_VECCFG5_VEC_EV_SHIFT                  (0)       /* Bits 0-3: Select trigger event for vector 5 */
#define AUX_SYSIF_VECCFG5_VEC_EV_MASK                   (15 << AUX_SYSIF_VECCFG5_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG5_VEC_EV(n)                   ((uint32_t)(n) << AUX_SYSIF_VECCFG5_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG5_VEC_EV_NONE                 (0 << AUX_SYSIF_VECCFG5_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG5_VEC_EV_PROG_WU0             (1 << AUX_SYSIF_VECCFG5_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG5_VEC_EV_PROG_WU1             (2 << AUX_SYSIF_VECCFG5_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG5_VEC_EV_PROG_WU2             (3 << AUX_SYSIF_VECCFG5_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG5_VEC_EV_PROG_WU3             (4 << AUX_SYSIF_VECCFG5_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG5_VEC_EV_SW_WU0               (5 << AUX_SYSIF_VECCFG5_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG5_VEC_EV_SW_WU1               (6 << AUX_SYSIF_VECCFG5_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG5_VEC_EV_SW_WU2               (7 << AUX_SYSIF_VECCFG5_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG5_VEC_EV_SW_WU3               (8 << AUX_SYSIF_VECCFG5_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG5_VEC_EV_AON_RTC_CH2_DLY      (9 << AUX_SYSIF_VECCFG5_VEC_EV_SHIFT)

/* AUX_SYSIF_VECCFG6 */

#define AUX_SYSIF_VECCFG6_VEC_EV_SHIFT                  (0)       /* Bits 0-3: Select trigger event for vector 6 */
#define AUX_SYSIF_VECCFG6_VEC_EV_MASK                   (15 << AUX_SYSIF_VECCFG6_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG6_VEC_EV(n)                   ((uint32_t)(n) << AUX_SYSIF_VECCFG6_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG6_VEC_EV_NONE                 (0 << AUX_SYSIF_VECCFG6_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG6_VEC_EV_PROG_WU0             (1 << AUX_SYSIF_VECCFG6_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG6_VEC_EV_PROG_WU1             (2 << AUX_SYSIF_VECCFG6_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG6_VEC_EV_PROG_WU2             (3 << AUX_SYSIF_VECCFG6_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG6_VEC_EV_PROG_WU3             (4 << AUX_SYSIF_VECCFG6_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG6_VEC_EV_SW_WU0               (5 << AUX_SYSIF_VECCFG6_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG6_VEC_EV_SW_WU1               (6 << AUX_SYSIF_VECCFG6_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG6_VEC_EV_SW_WU2               (7 << AUX_SYSIF_VECCFG6_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG6_VEC_EV_SW_WU3               (8 << AUX_SYSIF_VECCFG6_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG6_VEC_EV_AON_RTC_CH2_DLY      (9 << AUX_SYSIF_VECCFG6_VEC_EV_SHIFT)

/* AUX_SYSIF_VECCFG7 */

#define AUX_SYSIF_VECCFG7_VEC_EV_SHIFT                  (0)       /* Bits 0-3: Select trigger event for vector 7 */
#define AUX_SYSIF_VECCFG7_VEC_EV_MASK                   (15 << AUX_SYSIF_VECCFG7_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG7_VEC_EV(n)                   ((uint32_t)(n) << AUX_SYSIF_VECCFG7_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG7_VEC_EV_NONE                 (0 << AUX_SYSIF_VECCFG7_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG7_VEC_EV_PROG_WU0             (1 << AUX_SYSIF_VECCFG7_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG7_VEC_EV_PROG_WU1             (2 << AUX_SYSIF_VECCFG7_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG7_VEC_EV_PROG_WU2             (3 << AUX_SYSIF_VECCFG7_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG7_VEC_EV_PROG_WU3             (4 << AUX_SYSIF_VECCFG7_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG7_VEC_EV_SW_WU0               (5 << AUX_SYSIF_VECCFG7_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG7_VEC_EV_SW_WU1               (6 << AUX_SYSIF_VECCFG7_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG7_VEC_EV_SW_WU2               (7 << AUX_SYSIF_VECCFG7_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG7_VEC_EV_SW_WU3               (8 << AUX_SYSIF_VECCFG7_VEC_EV_SHIFT)
#  define AUX_SYSIF_VECCFG7_VEC_EV_AON_RTC_CH2_DLY      (9 << AUX_SYSIF_VECCFG7_VEC_EV_SHIFT)

/* AUX_SYSIF_EVSYNCRATE */

#define AUX_SYSIF_EVSYNCRATE_AUX_TIMER2_SYNC_RATE            (1 << 0)  /* Bit 0:  Select synchronization rate for
                                                                        *         AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV0..AUX_TIMER2_EV3
                                                                        *         and AUX_TIMER2_PULSE */
#  define AUX_SYSIF_EVSYNCRATE_AUX_TIMER2_SYNC_RATE_BUS_RATE AUX_SYSIF_EVSYNCRATE_AUX_TIMER2_SYNC_RATE
#  define AUX_SYSIF_EVSYNCRATE_AUX_TIMER2_SYNC_RATE_SCE_RATE (0)
#define AUX_SYSIF_EVSYNCRATE_AUX_COMPB_SYNC_RATE             (1 << 1)  /* Bit 1:  Select synchronization rate for
                                                                        *         AUX_EVCTL:EVSTAT2.AUX_COMPB event */
#  define AUX_SYSIF_EVSYNCRATE_AUX_COMPB_SYNC_RATE_BUS_RATE  AUX_SYSIF_EVSYNCRATE_AUX_COMPB_SYNC_RATE
#  define AUX_SYSIF_EVSYNCRATE_AUX_COMPB_SYNC_RATE_SCE_RATE  (0)
#define AUX_SYSIF_EVSYNCRATE_AUX_COMPA_SYNC_RATE             (1 << 2)  /* Bit 2: Select synchronization rate for
                                                                        *        AUX_EVCTL:EVSTAT2.AUX_COMPA event  */
#  define AUX_SYSIF_EVSYNCRATE_AUX_COMPA_SYNC_RATE_BUS_RATE  AUX_SYSIF_EVSYNCRATE_AUX_COMPA_SYNC_RATE
#  define AUX_SYSIF_EVSYNCRATE_AUX_COMPA_SYNC_RATE_SCE_RATE  (0)

/* AUX_SYSIF_PEROPRATE */

#define AUX_SYSIF_PEROPRATE_MAC_OP_RATE                  (1 << 0)  /* Bit 0:  Select operational rate for AUX_MAC */
#  define AUX_SYSIF_PEROPRATE_MAC_OP_RATE_BUS_RATE       AUX_SYSIF_PEROPRATE_MAC_OP_RATE
#  define AUX_SYSIF_PEROPRATE_MAC_OP_RATE_SCE_RATE       (0)
#define AUX_SYSIF_PEROPRATE_SPIM_OP_RATE                 (1 << 1)  /* Bit 1:  Select operational rate for AUX_SPIM */
#  define AUX_SYSIF_PEROPRATE_SPIM_OP_RATE_BUS_RATE      AUX_SYSIF_PEROPRATE_SPIM_OP_RATE
#  define AUX_SYSIF_PEROPRATE_SPIM_OP_RATE_SCE_RATE      (0)
#define AUX_SYSIF_PEROPRATE_TIMER01_OP_RATE              (1 << 2)  /* Bit 2:  Select operational rate for AUX_TIMER01 */
#  define AUX_SYSIF_PEROPRATE_TIMER01_OP_RATE_BUS_RATE   AUX_SYSIF_PEROPRATE_TIMER01_OP_RATE
#  define AUX_SYSIF_PEROPRATE_TIMER01_OP_RATE_SCE_RATE   (0)
#define AUX_SYSIF_PEROPRATE_ANAIF_DAC_OP_RATE            (1 << 3)  /* Bit 3:  Select operational rate for AUX_ANAIF
                                                                    * DAC sample clock state machine */
#  define AUX_SYSIF_PEROPRATE_ANAIF_DAC_OP_RATE_BUS_RATE AUX_SYSIF_PEROPRATE_ANAIF_DAC_OP_RATE
#  define AUX_SYSIF_PEROPRATE_ANAIF_DAC_OP_RATE_SCE_RATE (0)

/* AUX_SYSIF_ADCCLKCTL */

#define AUX_SYSIF_ADCCLKCTL_REQ                         (1 << 0)  /* Bit 0:  ADC clock request */
#define AUX_SYSIF_ADCCLKCTL_ACK                         (1 << 1)  /* Bit 1:  Clock acknowledgment */

/* AUX_SYSIF_TDCCLKCTL */

#define AUX_SYSIF_TDCCLKCTL_REQ                         (1 << 0)  /* Bit 0:  TDC counter clock request */
#define AUX_SYSIF_TDCCLKCTL_ACK                         (1 << 1)  /* Bit 1:  TDC counter clock acknowledgment */

/* AUX_SYSIF_TDCREFCLKCTL */

