apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_aux_sysif.h
#define AUX_SYSIF_TDCREFCLKCTL_REQ                      (1 << 0)  /* Bit 0:  TDC reference clock request */
#define AUX_SYSIF_TDCREFCLKCTL_ACK                      (1 << 1)  /* Bit 1:  TDC reference clock acknowledgment */

/* AUX_SYSIF_TIMER2CLKCTL */

#define AUX_SYSIF_TIMER2CLKCTL_SRC_SHIFT                (0)       /* Bits 0-2: Select clock source for AUX_TIMER2 */
#define AUX_SYSIF_TIMER2CLKCTL_SRC_MASK                 (7 << AUX_SYSIF_TIMER2CLKCTL_SRC_SHIFT)
#  define AUX_SYSIF_TIMER2CLKCTL_SRC(n)                 ((uint32_t)(n) << AUX_SYSIF_TIMER2CLKCTL_SRC_SHIFT)
#  define AUX_SYSIF_TIMER2CLKCTL_SRC_NONE               (0 << AUX_SYSIF_TIMER2CLKCTL_SRC_SHIFT)) /* No clock */
#  define AUX_SYSIF_TIMER2CLKCTL_SRC_SCLK_LF            (1 << AUX_SYSIF_TIMER2CLKCTL_SRC_SHIFT)) /* SCLK_LF */
#  define AUX_SYSIF_TIMER2CLKCTL_SRC_SCLK_MF            (2 << AUX_SYSIF_TIMER2CLKCTL_SRC_SHIFT)) /* SCLK_MF */
#  define AUX_SYSIF_TIMER2CLKCTL_SRC_SCLK_HFDIV2        (4 << AUX_SYSIF_TIMER2CLKCTL_SRC_SHIFT)) /* SCLK_HF / 2 */

/* AUX_SYSIF_TIMER2CLKSTAT */

#define AUX_SYSIF_TIMER2CLKSTAT_STAT_SHIFT              (0)       /* Bits 0-2: AUX_TIMER2 clock source status */
#define AUX_SYSIF_TIMER2CLKSTAT_STAT_MASK               (7 << AUX_SYSIF_TIMER2CLKSTAT_STAT_SHIFT)
#  define AUX_SYSIF_TIMER2CLKSTAT_STAT(n)               ((uint32_t)(n) << AUX_SYSIF_TIMER2CLKSTAT_STAT_SHIFT)
#  define AUX_SYSIF_TIMER2CLKSTAT_STAT_NONE             (0 << AUX_SYSIF_TIMER2CLKSTAT_STAT_SHIFT)) /* No clock */
#  define AUX_SYSIF_TIMER2CLKSTAT_STAT_SCLK_LF          (1 << AUX_SYSIF_TIMER2CLKSTAT_STAT_SHIFT)) /* SCLK_LF */
#  define AUX_SYSIF_TIMER2CLKSTAT_STAT_SCLK_MF          (2 << AUX_SYSIF_TIMER2CLKSTAT_STAT_SHIFT)) /* SCLK_MF */
#  define AUX_SYSIF_TIMER2CLKSTAT_STAT_SCLK_HFDIV2      (4 << AUX_SYSIF_TIMER2CLKSTAT_STAT_SHIFT)) /* SCLK_HF / 2 */

/* AUX_SYSIF_TIMER2CLKSWITCH */

#define AUX_SYSIF_TIMER2CLKSWITCH_RDY                   (1 << 0)  /* Bit 0:  Status of clock switcher */
                                                                  /* 1: TIMER2CLKCTL.SRC equals TIMER2CLKSTAT.STA */

/* AUX_SYSIF_TIMER2DBGCTL */

#define AUX_SYSIF_TIMER2DBGCTL_DBG_FREEZE_EN            (1 << 0)  /* Bit 0:  Debug freeze enable */

/* AUX_SYSIF_CLKSHIFTDET */

#define AUX_SYSIF_CLKSHIFTDET_STAT                      (1 << 0)  /* Bit 0:  Clock shift detection */

/* AUX_SYSIF_RECHARGETRIG */

#define AUX_SYSIF_RECHARGETRIG_TRIG                     (1 << 0)  /* Bit 0:   Recharge trigger */

/* AUX_SYSIF_RECHARGEDET */

#define AUX_SYSIF_RECHARGEDET_EN                        (1 << 0)  /* Bit 0:  VDDR recharge detector enable */
#define AUX_SYSIF_RECHARGEDET_STAT                      (1 << 1)  /* Bit 1:  VDDR recharge detector status */

/* AUX_SYSIF_RTCSUBSECINC0 */

#define AUX_SYSIF_RTCSUBSECINC0_INC15_0_SHIFT           (0)       /* Bits 0-15: New value for bits 15:0 in AON_RTC:SUBSECINC  */
#define AUX_SYSIF_RTCSUBSECINC0_INC15_0_MASK            (0xffff << AUX_SYSIF_RTCSUBSECINC0_INC15_0_SHIFT)
#  define AUX_SYSIF_RTCSUBSECINC0_INC15_0(n)            ((uint32_t)(n) << AUX_SYSIF_RTCSUBSECINC0_INC15_0_SHIFT)

/* AUX_SYSIF_RTCSUBSECINC1 */

#define AUX_SYSIF_RTCSUBSECINC1_INC23_16_SHIFT          (0)       /* Bits 0-7: New value for bits 23:16 in AON_RTC:SUBSECINC */
#define AUX_SYSIF_RTCSUBSECINC1_INC23_16_MASK           (0xff << AUX_SYSIF_RTCSUBSECINC1_INC23_16_SHIFT)
#  define AUX_SYSIF_RTCSUBSECINC1_INC23_16(n)           ((uint32_t)(n) << AUX_SYSIF_RTCSUBSECINC1_INC23_16_SHIFT)

/* AUX_SYSIF_RTCSUBSECINCCTL */

#define AUX_SYSIF_RTCSUBSECINCCTL_UPD_REQ               (1 << 0)  /* Bit 0:  Request AON_RTC to update AON_RTC:SUBSECINC */
#define AUX_SYSIF_RTCSUBSECINCCTL_UPD_ACK               (1 << 1)  /* Bit 1:  Update acknowledgment */

/* AUX_SYSIF_RTCSEC */

#define AUX_SYSIF_RTCSEC_SEC_SHIFT                      (0)       /* Bits 0-15: Bits 15:0 in AON_RTC:SEC.VALUE */
#define AUX_SYSIF_RTCSEC_SEC_MASK                       (0xffff << AUX_SYSIF_RTCSEC_SEC_SHIFT)
#  define AUX_SYSIF_RTCSEC_SEC(n)                       ((uint32_t)(n) << AUX_SYSIF_RTCSEC_SEC_SHIFT)

/* AUX_SYSIF_RTCSUBSEC */

#define AUX_SYSIF_RTCSUBSEC_SUBSEC_SHIFT                (0)       /* Bits 0-15: Bits 31:16 in AON_RTC:SUBSEC.VALUE */
#define AUX_SYSIF_RTCSUBSEC_SUBSEC_MASK                 (0xffff << AUX_SYSIF_RTCSUBSEC_SUBSEC_SHIFT)
#  define AUX_SYSIF_RTCSUBSEC_SUBSEC(n)                 ((uint32_t)(n) << AUX_SYSIF_RTCSUBSEC_SUBSEC_SHIFT)

/* AUX_SYSIF_RTCEVCLR */

#define AUX_SYSIF_RTCEVCLR_RTC_CH2_EV_CLR               (1 << 0)  /* Bit 0:  Clear events from AON_RTC channel 2 */

/* AUX_SYSIF_BATMONBAT */

#define AUX_SYSIF_BATMONBAT_FRAC_SHIFT                  (0)       /* Bits 0-7: See AON_BATMON:BAT.FRAC */
#define AUX_SYSIF_BATMONBAT_FRAC_MASK                   (0xff << AUX_SYSIF_BATMONBAT_FRAC_SHIFT)
#  define AUX_SYSIF_BATMONBAT_FRAC(n)                   ((uint32_t)(n) << AUX_SYSIF_BATMONBAT_FRAC_SHIFT)
#define AUX_SYSIF_BATMONBAT_INT_SHIFT                   (8)       /* Bits 8-10: See AON_BATMON:BAT.INT */
#define AUX_SYSIF_BATMONBAT_INT_MASK                    (7 << AUX_SYSIF_BATMONBAT_INT_SHIFT)
#  define AUX_SYSIF_BATMONBAT_INT(n)                    ((uint32_t)(n) << xxAUX_SYSIF_BATMONBAT_INT_SHIFT

/* AUX_SYSIF_BATMONTEMP */

#define AUX_SYSIF_BATMONTEMP_FRAC_SHIFT                 (0)       /* Bits 0-1: See AON_BATMON:TEMP.FRAC */
#define AUX_SYSIF_BATMONTEMP_FRAC_MASK                  (3 << AUX_SYSIF_BATMONTEMP_FRAC_SHIFT)
#  define AUX_SYSIF_BATMONTEMP_FRAC(n)                  ((uint32_t)(n) << AUX_SYSIF_BATMONTEMP_FRAC_SHIFT)
#define AUX_SYSIF_BATMONTEMP_INT_SHIFT                  (2)       /* Bits 2-10: See AON_BATMON:TEMP.INT */
#define AUX_SYSIF_BATMONTEMP_INT_MASK                   (0x1ff << AUX_SYSIF_BATMONTEMP_INT_SHIFT)
#  define AUX_SYSIF_BATMONTEMP_INT(n)                   ((uint32_t)(n) << AUX_SYSIF_BATMONTEMP_INT_SHIFT)
#define AUX_SYSIF_BATMONTEMP_SIGN_SHIFT                 (11)       /* Bits 11-15: Sign extension of INT */
#define AUX_SYSIF_BATMONTEMP_SIGN_MASK                  (31 << AUX_SYSIF_BATMONTEMP_SIGN_SHIFT)
#  define AUX_SYSIF_BATMONTEMP_SIGN(n)                  ((uint32_t)(n) << AUX_SYSIF_BATMONTEMP_SIGN_SHIFT)

/* AUX_SYSIF_TIMERHALT */

#define AUX_SYSIF_TIMERHALT_AUX_TIMER0                  (1 << 0)  /* Bit 0:  Halt AUX_TIMER01 Timer 0 */
#define AUX_SYSIF_TIMERHALT_AUX_TIMER1                  (1 << 1)  /* Bit 1:  Halt AUX_TIMER01 Timer 1 */
#define AUX_SYSIF_TIMERHALT_AUX_TIMER2                  (1 << 2)  /* Bit 2:  Halt AUX_TIMER2 */
#define AUX_SYSIF_TIMERHALT_PROGDLY                     (1 << 3)  /* Bit 3:  Halt programmable delay */

/* AUX_SYSIF_TIMER2BRIDGE */

#define AUX_SYSIF_TIMER2BRIDGE_BUSY                     (1 << 0)  /* Bit 0:  Status of bus transactions to AUX_TIMER2 */

/* AUX_SYSIF_SWPWRPROF */

#define AUX_SYSIF_SWPWRPROF_STAT_SHIFT                  (0)       /* Bits 0-2:  Software status bits read by the power profiler */
#define AUX_SYSIF_SWPWRPROF_STAT_MASK                   (7 << AUX_SYSIF_SWPWRPROF_STAT_SHIFT)
#  define AUX_SYSIF_SWPWRPROF_STAT(n)                   ((uint32_t)(n) << AUX_SYSIF_SWPWRPROF_STAT_SHIFT)

#endif /* __ARCH_ARM_SRC_TIVA_HARDWARE_CC13X2_CC26X2_CC13X2_CC26X2_AUX_SYSIF_H */
